package com.flzc.base.util;

import java.util.regex.Matcher;
import java.util.regex.Pattern;
import org.apache.commons.lang.StringUtils;

public class WordControlUtil {
	public static String time = "0";

	public static String forbidKeywords = "大法洪传|八九|白立朴|白梦|鲍戈|鲍彤|北大三角地论坛|北韩|北京当局|北京之春|北美自由论坛|博讯|蔡崇国|藏独|曹长青|曹刚川|柴玲|常劲|陈炳基|陈军|陈蒙|陈破空|陈希同|陈小同|陈宣良|陈一谘|程凯|程铁军|程真|迟浩田|赤匪|春夏自由论坛|达赖|大纪元新闻网|大纪园|大家论坛|大中国论坛|大中华论坛|戴相龙|登辉|邓笑贫|迪里夏提|丁关根|丁元|丁子霖|东土耳其斯坦|东西南北论坛|独立台湾会|杜智富|屙民|发轮|发正念|法愣|法抡|法仑|法伦|法轮|法论|法十轮十功|法谪|法谪功|反封锁技术|反腐败论坛|反共|李洪志|方励之|方舟子|飞扬论坛|费良勇|风雨神州论坛|封从德|冯东海|冯素英|佛展千手法|付申奇|傅申奇|傅志寰|高文谦|高自联|戈扬|工自联|共党|共匪|共狗|关卓中|郭伯雄|郭罗基|郭岩华|韩东方|韩联潮|何德普|宏法|洪传|洪吟|洪哲胜|洪志|胡紧掏|胡锦涛|胡锦滔|胡锦淘|胡景涛|华建敏|华通时事论坛|华夏文摘|华语世界论坛|华岳时事论坛|黄慈萍|黄祸|黄菊|鸡毛信文汇|姬胜德|积克馆|贾庆林|贾廷安|贾育台|建国党|江core|江八点|江流氓|江罗|江绵恒|江青|江戏子|江则民|江泽慧|江泽民|江澤民|江贼|江贼民|江折民|江猪|江猪媳|江主席|姜春云|将则民|僵贼|僵贼民|疆独|金尧如|锦涛|邝锦文|黎安友|李长春|李大师|李登辉|李红痔|李宏志|李洪宽|李继耐|李兰菊|李岚清|李录|李禄|李鹏|李瑞环|李少民|李淑娴|李旺阳|李文斌|李小朋|李小鹏|李月月鸟|李志绥|连胜德|廉政大论坛|梁光烈|梁擎墩|两岸关系|两岸三地论坛|两个中国|廖锡龙|林保华|林长盛|林樵清|林慎立|刘宾深|刘宾雁|刘国凯|刘华清|刘俊国|刘凯中|刘千石|刘山青|刘士贤|刘文胜|刘晓波|刘晓竹|刘永川|龙虎豹|陆委会|吕京花|吕秀莲|抡功|伦功|轮大|轮功|罗干|罗礼诗|马大维|马良骏|马三家|马时敏|毛厕洞|毛贼东|美国参考|美国之音|蒙独|蒙古独立|民进党|民联|民意论坛|莫伟强|木子论坛|南大自由论坛|倪育贤|你说我说论坛|潘国平|祁建|齐墨|钱达|钱国梁|钱其琛|乔石|轻舟快讯|热站政论网|人民内情真相|人民之声论坛|邵家健|神通加持法|沈彤|盛华仁|时代论坛|时事论坛|世界经济导报|水扁|税力|司马晋|司马璐|司徒华|宋平|宋书元|宋祖英|苏绍智|苏晓康|台独|台盟|台湾独立|台湾狗|台湾建国运动组织|台湾青年独立联盟|台湾政论区|台湾自由联盟|太子党|汤光中|唐柏桥|唐捷|滕文生|天安门录影带|天安门屠杀|天安门一代|童屹|统独|统独论坛|万润南|万维读者论坛|万晓东|汪岷|王宝森|王炳章|王策|王超华|王辅臣|王涵万|王沪宁|王军涛|王力雄|王瑞林|王润生|王若望|王希哲|王秀丽|王冶坪|尉健行|魏京生|魏新生|温家宝|温元凯|吴百益|吴邦国|吴方城|吴官正|吴弘达|吴宏达|吴仁华|吴学灿|吴学璨|吾尔开希|西藏独立|项怀诚|项小吉|谢长廷|谢选骏|谢中之|辛灏年|新观察论坛|新华举报|新华内情|新华通论坛|新疆独立|新生网|新闻封锁|新语丝|邢铮|熊炎|熊焱|徐邦秦|徐才厚|徐匡迪|徐水良|许家屯|学潮|学联|学自联|严家其|严家祺|阎明复|杨怀安|杨建利|杨月清|姚月谦|夜话紫禁城|一中一台|易丹轩|易志熹|尹庆民|由喜贵|于浩成|余英时|舆论反制|宇明网|远志明|曾培炎|曾庆红|张伯笠|张宏堡|张万年|张伟国|张昭富|张志清|赵海青|赵品潞|赵紫阳|真善忍|争鸣论坛|正见网|正义党论坛|指点江山论坛|中国复兴论坛|中国孤儿院|中国和平|中国论坛|中国社会进步党|中国社会论坛|中国威胁论|中国问题论坛|中国真实内容|中国之春|中国猪|中华大众|中华讲清|中华人民实话实说|中华养生益智功|中华真实报道|钟山风雨论坛|晚年周恩来|周锋锁|周天法|朱嘉明|朱琳|朱毛|朱容基|朱溶剂|朱镕基|猪聋畸|自民党|自由民主论坛|法轮功|砝仑|砝轮|シ去车仑|洗瑙|yuanmingeurope|fawanghuihui|大法洪|洪法交流|610办公室|江罗集团|大法大福|大砝弟子|中共走狗|共产小丑|中共恶霸|共产无赖|天安门大屠杀|天安门事件|平反六四|八九见证|六四屠杀|六四屠城|六四政变|6月4日|自焚zf|黄菊|劫后天府泪纵横|零八宪章|中国民主转型|延安何方|中共第五代|大逆转|毛泽东玄机|刘少奇|张春桥|姚文元|江青文集|六四真相|中国民主|挖肃灾难|大饥荒|戒严部队|天安门时报|灾难村|淫の方程式|teen sexy|艳舞淫业|洋屄淫の方程式|经典炮图|翘臀嫩穴|丁字裤翘臀|童颜巨乳|轮奸内射|性感诱惑|淫妇自慰|空姐性交|援交薄码|本土无码|美乳斗艳|美乳美穴|淫妻交换|舔鸡巴|奇淫宝鉴|日屄|骚B熟女|美骚妇|近亲相奸|淫丝荡袜|跨下呻吟|艳乳|奴隷调教|无毛美少女|白虎小穴|阴阜高耸|流蜜汁|翘臀嫩逼|日本素人|淫荡贵妇|口交放尿|爆乳人妻|鬼畜轮奸|媚药少年|妖媚熟母|浴室乱伦|暴奸|日本有码生奸内射|无修正|激情打炮|国产嫖娼|国产AV|制服美妇|白液四溅|淫水横流|无码彩图|带套肛交|插入内射|放尿|大乱交|东热空姐|入穴一游|精液榨取|大波粉B|丰唇艳姬|性感乳娘|互舔淫穴|群奸轮射|魅惑巨乳|丝袜淫妇|高级逼|无码炮图|乳此动人|MM屄|群阴会|大波骚妇|美臀嫰穴|人性本色|无码做爱|淫东方|极品波神|口爆吞精|国产偷拍|淫乱工作|放荡熟女|清晰内射|白浆四溅|嫩穴肉缝|街头扒衣|叔嫂肉欲|雪腿玉胯|口内爆射|肉感炮友|骚妇掰B|嫩BB|爱妻淫穴|白嫩骚妇|肛门拳交|无码精选|梅花屄|灌满精液|超毛大鲍|猛操狂射|莲花逼|熟妇骚器|潮喷|自慰抠穴|内射美妇|无码体验|人妻榨乳|毒龙舔脚|吞精骚妹|拔屄自拍|性爱擂台|紧缚凌辱|洗肠射尿|泉学淫|奸淫电车|人妻色诱|性奴会|堕淫|淫浆|密室淫行|颜骑|狂乳激揺|亮屄|互淫|騷浪|操肿|逼毛|射爽|无码淫女|胸濤乳浪|蘚鮑|玩逼|夫妻乱交|制服狩|淫虐|黑屄|無毛穴|我就去色|奶大屄肥|骚浪美女|淫痴|拔屄|肏屄|风骚欲女|穴海|舌头穴|亮穴|换妻杂交|人妻做爱|操穴喷水|狂插|插逼|幼男|黑逼|爆操|肉箫|粉屄|插穴止痒|巨骚|口射|骚乳|骚妻|多人轮|食精|漏逼|狂操|爆乳娘|骚屄|奶挺臀翘|插阴茎|大奶美逼|扒屄|黑毛屄|高潮白浆|痴乳|肉便器|性战擂台|鬼輪姦|肉逼|淫女炮图|乳爆|淫亂潮吹|浴尿|母奸|淫水横溢|淫样|熟妇人妻|性交吞精|発妻|発射|姦染|姫辱|幹砲|淫告白|插后庭|性佣|乳射|操爽|爽穴|操黑|嫩缝|插比|朝天穴|操射|嫩鲍|公媳乱|骚妈|骚母|女屄|激插|吃鸡巴|慰春情|暴干|金毛穴|集体淫|母子交欢|体奸|淫B|巨炮兵团|爆草|屄屄|嫐屄|操妻|肛屄|足脚交|a4u|小嫩鸡|露屄|酥穴|舔B|柔阴术|屄毛|嫩奶|相奸|厕所盗摄|a4y|淫师荡母|艳妇淫女|品穴|欠干|掰穴打洞|淫水翻騰|桃园蜜洞|盗撮|一本道|二穴中出|薄码|肛门喷水|奴畜抄|少修正|乳尻|连続失禁|巧淫奸戏|羞耻母|av貼圖|99bb|18禁|japansweet|g点|g片|sm|tw18|sex|adult|asiasex|teen|16dy-图库|teensexy|無碼電影|獸交|欢欢娱乐时空|爱液|近親相姦|插b|赤裸|操b|乱伦|荡妇|操逼|买春|荡女|妹妹阴毛|浪穴|插你|免费成人网站|露穴|插我|免费偷窥网|美穴|插穴|免费A片|猛插|吃精|摩洛客|迷药|抽插|嫩b|嫩穴|大乳|捏弄|肉穴|调教|女优|乳交|龟头|肉棒|乳头|骚姐姐|无码|激情电影|色情|吸精|精液|色区|现代情色小说|口交|色书库|小穴|轮暴|射颜|性交|迷奸|手淫|性交图|奶子|兽交|性息|肉欲|吸精少女|艳情小说|乳房|下流地带|阳具|色猫|性虎|阴部特写|色欲|性饥渴|阴道|性爱|阴部|阴户|亚情|淫荡|淫书|阴唇|淫妹|淫穴|阴蒂|淫图|幼女|阴茎|幼交|玉蒲团|玉女心经|淫亂|欲火|援助交易|淫女|援交妹|中国成人论坛|淫蕩|嫩屄|中国性爱城|淫水|嫩女|自拍写真|淫汁|噴精|做爱图片|幼圖|屁眼|掰穴|中文搜性网|情色天崖|万淫堂|子宫|情色文学|穴图|自慰|群交亂舞|穴淫|鷄巴|日本骚货|學生妹|肉唇|咬着龟头|１８歲淫亂|肉沟|要射了|999日本妹|肉棍干骚妇|一夜性网|幹炮|肉壶|阴茎插小穴|摸阴蒂|肉淫器吞精|陰穴新玩法|金鳞岂是池中物|骚逼|婬乱军团|掰穴皮卡丘|骚妹|淫逼|白虎少妇|骚女|淫姐|白虎阴穴|骚水|淫浪|包二奶|骚穴|淫流|暴淫|色狐狸网址|淫糜|逼痒|色狼论坛|淫蜜|蕩妹|色狼小说|淫魔|肥逼|湿穴|淫母|粉穴|爽死我了|淫妞|干穴|舔逼|淫奴|舔屁眼|淫娃|口活|淫液|狼友|钻插|春药|亂倫|H动漫|风艳阁|hardcore|交换夫妻|激情小说|amateur|情色|兽欲|做爱电影|全裸|色诱|舔脚|秘唇|秘裂|蜜洞|蜜穴|采花堂|玉穴|含屌|淫情|亚洲性虐|亚洲情色网|菊花蕾|鸡吧|强奸处女|大力抽送|夫妻自拍|鸡巴|干的爽熟女|鸡巴暴胀|肛交|操穴|美乳|anal|裹本|大众色情成人网|肉蒲团|淫妇|火辣图片|后庭|嫩逼|淫声浪语|淫叫|淫贱|疯狂抽送|男女交欢|欢乐性今宵|淫河|极品波霸|巨乳|强暴|兽奸|性愛圖片|多人性愛|流淫|性欲|销魂洞|炮友之家|操屄|操烂|浪女|成人网站|一夜情|色情论坛|淫色|乳沟|性虎色网|一夜欢|淫虫|淫欲日本|姦淫|hotsex|操死|给你爽|叫床|色迷城|偷窥图片|porn|petgirl|性奴|小姐打飞机|骚女叫春|大奶头|少女被插|成人百强|incest|fuck|Ｘ到噴屎尿|天天干贴图|奸幼|口淫|密穴贴图|按摩棒|凌辱|轮奸|操我|偷欢|豪乳|小逼|喷精|酥痒|露逼|品色堂|脱内裤|美女高潮|浪妇|发浪|日逼|嫖妓指南|浪叫|肉洞|肉缝|肉茎|阴缔|色窝窝|菊花洞|插暴|逼奸|成人自拍|人妻|被操|自拍美穴|做爱|巨奶|抠穴|内射|骚洞|颜射|肉具|阴精|肉棍|欲仙欲浪|阴阜|淫水爱液|玉乳|阴屄|阴核|被插|群魔色舞|露B|吞精|扒穴|母子奸情|暴乳|六月联盟|人妻熟女|成人午夜场|55sss|偷拍区|色界|买春堂|张筱雨|丁香社区|性之站|xiao77|爱图公园|成人社区|极品黑丝|色色五月天|群交|丝袜写真|鹿城娱乐|激情聊天|天天情色|色色|三八淫|成人小说|幼香阁|做爱自拍|成人文学|隐窝窝|淫妻|情色艺术天空|乱伦熟女网|夫妻俱乐部|222se图片|插阴|激情交友|偷拍|露阴照|诱色uu|淫色贴图|美幼|就去色色|厕奴|97sese|熟妇|嫩鲍鱼|mm美图|酥胸诱惑|日本AV女优|走光偷拍|五月天|美女走光|77bbb|人体摄影|33bbb走光|虎骑|东北xx网|激情贴图|咪咪图片|玛雅网|成人论坛|成人导航|成人bt|就去诱惑|深爱色色|周六性吧|浴室自拍|厕所偷拍|爆乳|BlowJobs|成人A片|诱惑视频|激情裸体|夫妻多p|裙下风光|丽春苑|我就色|嘻游中国|窝窝客|释欲|操母狗|银民吧|你色吗|御の二代目|亚洲色|裙内偷拍|丝袜足交|碧香亭|男女蒲典|肮脏美学|爱色cc|色97爱|亚洲有码|妹妹骚图|丝诱|欲仙欲死|宾馆女郎|人妻自拍|丝袜高跟|美腿丝足|色情工厂|偷拍美穴|好色cc|色色婷婷|原味丝袜|无码长片|美体艳姿|裸露自拍|淫水涟涟|颜射自拍|针孔偷拍|放荡少妇|熟母|放荡少妇宾馆|成人图片|肉丝裤袜|性感肉丝|黄金圣水|sm调教|拳交|脚交|打野炮|迫奸|勾魂少妇|赤裸天使|品香堂|女尻|淫欲世家|北京xx网|我要性交|就去日|虐奴|SM女王|爱幼阁|情色导航|乳此丝袜|巨屌|欧美大乳|日本灌肠|花样性交|欧美无套|集体性爱|裸陪|骚妇露逼|国产骚货|夫妻3p|炮友|操B指南|大奶骚女|淫水丝袜|亚洲淫娃|性愛插穴|母女双飞|熟女乱伦|日本熟母|老少乱伦|SM舔穴|幼逼|幼妓|無碼H漫|淫水四溅|素人娘|大胆少女|大胆出位 |乳此丰满|旅馆自拍|制服誘惑|屄屄特写|无套自拍|舔屄|熟女颜射|快乐AV|色色成人|要色色|国产无码|迷奸系列|耻辱轮奸|强制浣肠|性交无码|巨乳素人|援交自拍|惹火自拍|妩媚挑逗|凸肉优|胯下呻吟|骚姨妈|撅起大白腚|淫驴屯|裸体少妇|骚妹妹|少妇偷情|插穴手淫|护士诱惑|射奶|双龙入洞|群奸乱交|杨思敏|美女吞精|极品白虎|野外性交|处女开包|曲线消魂|风骚淫荡|调教虐待|淫腔|白虎嫩B|淫肉诱惑|无码淫漫|明星淫图|激情潮喷|假阳具插穴|淫乱熟女|骚穴怒放|蝴蝶逼|高清性愛|馒头屄|自插小穴|高潮集锦|无码丝袜|SM援交|淫兽学园|俏臀摄魄|寂寞自摸|爱液横流|有容奶大|警奴|无码无套|无套内射|轮操|淫战群P|毛鲍|淫店|口爆|3P炮图|精液浴|酒店援交|性交课|淫乱诊所|乳霸|激凸走光|极品奶妹|湿身诱惑|人妻交换|暴力虐待|动漫色图|监禁陵辱|巨乳俏女医|熟女护士|生徒胸触|扉之阴|粉红穴|洋屄|台湾共和国|支联会|嫩模|婊子|成人书库|勃起|起点中文|zhulang|www.qidian.com|欢迎广大书友光临阅读，最新、最快、最火的连载作品尽在起点原创！|qidian|逐浪小说|起点原创|http://www.qidian.com|飞库|起点首发|起点MM网|潇湘首发|逐浪签约|逐浪首发|纵横首发|纵横中文网|红袖首发|签约纵横|签约起点|签约逐浪|签约红袖|签约潇湘|逐浪网|看书网|http://www.zongheng.com|起点签约|逐浪签约|红袖签约|潇湘签约|hongxiu|xxsy|readnovel|qukanshu|坚果网|17jg|hongshu|红薯网|小说阅读网|3g书城|天下女生阁|澄文中文小说网 |cwzww|思凡小说网|潇湘书院 |xxsy|十月枫丹网|shiyuefengdan|红薯网|hongshu|mffycs|3gsc|35xs|陌上香坊|msxf|凤鸣轩|fmx|qdmm|华夏网址|hxtk|jjwxc|feiku|booku|1001p|谋后书院|mouhou|faloo|readnovel|kanshu|feiku|世纪文学|2100book|inbook|http://www.shuhai.com|代开发票|代開|发票|發票|车票转让|車票轉讓|車票|车票专卖|轉讓|转讓|轉让|车票代|車票代|车票零售|车票转卖|顠|代售车票|转让车票|代卖车票|专卖车票|车票预|高价票|二手票";

	private static String[] regSensiveWords = { "17k", "17K", "17ｋ", "１７ｋ", "爱国善者", "真善忍", "五套功法", "宇宙最高法理", "砝仑", "砝伦",
			"砝轮", "シ去", "车仑", "工力", "功友", "法轮功", "大陆同修", "法?轮?功", "洗瑙", "李大师", "江浙民", "自由网", "正见网", "zhengjian",
			"yuanmingeurope", "xinsheng", "fawanghuihui", "新生网", "圆明网", "新生网", "freenet-china", "dajiyuan", "boxun",
			"falundafa", "falungongtime", "大法洪传", "弘法会", "灵修团体", "大法之声", "法正人间", "正法时期", "海外护法", "洪法交流", "大法弟子", "大法师傅",
			"610办公室", "江罗集团", "发正念", "放下生死", "大法大福", "大砝弟子", "正念正行", "中共走狗", "共产小丑", "共奴", "中共恶霸", "共产无赖", "天安门大屠杀",
			"天安门事件", "平反六四", "八九见证", "支联会", "六四屠杀", "六四屠城", "六四政变", "六四之役", "王维林", "六四母亲", "六四学潮", "六四血案", "卢展工", "王三运",
			"郑立中", "张昌平", "贺国强", "weizeng", "江泽民", "李鹏", "胡锦涛", "温家保", "吴邦国", "贾庆林", "黄菊", "吴官正", "李长春", "曾庆红", "罗干",
			"台独", "渐进式台独", "趋独拒统", "陈水扁总统", "李登辉总统", "鲁迅", "金庸", "古龙", "温瑞安", "起点中文", "cmfu", "逐浪文学", "zhulang", "何畅平庸",
			"淫の方程式", "经典炮图", "翘臀嫩穴", "丁字裤翘臀", "童颜巨乳", "春光外泻", "轮奸内射", "性感诱惑", "淫妇自慰", "空姐性交", "援交薄码", "本土无码", "美乳斗艳",
			"美乳美穴", "淫妻交换", "舔鸡巴", "奇淫宝鉴", "日屄", "骚B熟女", "美骚妇", "近亲相奸", "淫丝荡袜", "跨下呻吟", "艳乳", "奴隷调教", "无毛美少女", "白虎小穴",
			"阴阜高耸", "流蜜汁", "肛门喷水", "翘臀嫩逼", "日本素人", "淫荡贵妇", "口交放尿", "爆乳人妻", "鬼畜轮奸", "媚药少年", "妖媚熟母", "浴室乱伦", "暴奸",
			"日本有码生奸内射", "无修正", "激情打炮", "国产嫖娼", "国产AV", "制服美妇", "白液四溅", "淫水横流", "无码彩图", "带套肛交", "插入内射", "放尿", "大乱交",
			"东热空姐", "入穴一游", "精液榨取", "大波粉B", "丰唇艳姬", "性感乳娘", "互舔淫穴", "群奸轮射", "魅惑巨乳", "丝袜淫妇", "高级逼", "无码炮图", "乳此动人",
			"MM屄", "群阴会", "大波骚妇", "美臀嫰穴", "人性本色", "无码做爱", "淫东方", "极品波神", "口爆吞精", "国产偷拍", "淫乱工作", "放荡熟女", "清晰内射", "白浆四溅",
			"巨炮兵团", "嫩穴肉缝", "街头扒衣", "叔嫂肉欲", "雪腿玉胯", "口内爆射", "肉感炮友", "骚妇掰B", "嫩BB", "爱妻淫穴", "白嫩骚妇", "肛门拳交", "无码精选",
			"梅花屄", "灌满精液", "超毛大鲍", "猛操狂射", "莲花逼", "熟妇骚器", "潮喷", "自慰抠穴", "内射美妇", "无码体验", "人妻榨乳", "毒龙舔脚", "吞精骚妹", "拔屄自拍",
			"性爱擂台", "紧缚凌辱", "洗肠射尿", "泉学淫", "奸淫电车", "人妻色诱", "性奴会", "堕淫", "淫浆", "密室淫行", "颜骑", "狂乳激揺", "亮屄", "互淫", "騷浪",
			"操肿", "逼毛", "射爽", "无码淫女", "胸濤乳浪", "蘚鮑", "玩逼", "夫妻乱交", "制服狩", "淫虐", "黑屄", "無毛穴", "我就去色", "奶大屄肥", "骚浪美女",
			"淫痴", "拔屄", "肏屄", "风骚欲女", "穴海", "舌头穴", "亮穴", "换妻杂交", "人妻做爱", "操穴喷水", "狂插", "插逼", "幼男", "黑逼", "爆操", "肉箫",
			"粉屄", "插穴止痒", "巨骚", "口射", "骚乳", "骚妻", "多人轮", "食精", "漏逼", "狂操", "爆乳娘", "骚屄", "奶挺臀翘", "插阴茎", "大奶美逼", "扒屄",
			"黑毛屄", "高潮白浆", "痴乳", "肉便器", "性战擂台", "鬼輪姦", "肉逼", "淫女炮图", "乳爆", "淫亂潮吹", "小穴", "浴尿", "母奸", "淫水横溢", "淫样",
			"熟妇人妻", "性交吞精", "発妻", "発射", "姦染", "姫辱", "幹砲", "淫告白", "插后庭", "性佣", "乳射", "操爽", "爽穴", "操黑", "嫩缝", "插比", "朝天穴",
			"操射", "嫩鲍", "公媳乱", "骚妈", "骚母", "女屄", "激插", "吃鸡巴", "慰春情", "暴干", "金毛穴", "集体淫", "母子交欢", "体奸", "淫B", "爆草", "屄屄",
			"嫐屄", "操妻", "肛屄", "足脚交", "小嫩鸡", "露屄", "酥穴", "舔B", "柔阴术", "屄毛", "嫩奶", "相奸", "厕所盗摄", "淫师荡母", "艳妇淫女", "品穴",
			"欠干", "掰穴打洞", "淫水翻騰", "桃园蜜洞", "盗撮", "一本道", "二穴中出", "薄码", "奴畜抄", "少修正", "乳尻", "连続失禁", "巧淫奸戏", "羞耻母", "av貼圖",
			"18禁", "g点", "g片", "sex", "16dy-图库", "無碼電影", "獸交", "欢欢娱乐时空", "爱液", "爱女人", "近親相姦", "插b", "拔出来", "裤袜", "赤裸",
			"操b", "乱伦", "荡妇", "操逼", "买春", "荡女", "插进", "妹妹阴毛", "浪穴", "插你", "免费成人网站", "露穴", "插我", "免费偷窥网", "美穴", "插穴",
			"免费A片", "猛插", "吃精", "摩洛客", "迷药", "抽插", "嫩b", "嫩穴", "大乳", "捏弄", "肉穴", "调教", "女优", "乳交", "龟头", "肉棒", "乳头",
			"骚姐姐", "无码", "色情", "吸精", "精液", "色区", "现代情色小说", "口交", "色书库", "轮暴", "射颜", "性交", "迷奸", "手淫", "性交图", "奶子", "兽交",
			"性息", "肉欲", "吸精少女", "艳情小说", "乳房", "下流地带", "阳具", "色猫", "性虎", "阴部特写", "色欲", "性饥渴", "阴道", "性爱", "阴部", "阴户",
			"亚情", "淫荡", "淫书", "阴唇", "淫妹", "淫穴", "阴蒂", "淫图", "幼女", "阴茎", "幼交", "玉蒲团", "玉女心经", "淫亂", "欲火", "援助交易", "淫女",
			"援交妹", "中国成人论坛", "淫蕩", "嫩屄", "中国性爱城", "淫水", "嫩女", "自拍写真", "淫汁", "噴精", "做爱图片", "幼圖", "屁眼", "掰穴", "中文搜性网",
			"情色天崖", "万淫堂", "子宫", "情色文学", "穴图", "自慰", "群交亂舞", "穴淫", "鷄巴", "日本骚货", "艳舞淫业", "學生妹", "肉唇", "咬着龟头", "１８歲淫亂",
			"肉沟", "要射了", "999日本妹", "肉棍干骚妇", "一夜性网", "幹炮", "肉壶", "阴茎插小穴", "摸阴蒂", "肉淫器吞精", "陰穴新玩法", "金鳞岂是池中物", "骚逼",
			"婬乱军团", "掰穴皮卡丘", "骚妹", "淫逼", "白虎少妇", "骚女", "淫姐", "白虎阴穴", "骚水", "淫浪", "包二奶", "骚穴", "淫流", "暴淫", "色狐狸网址", "淫糜",
			"逼痒", "色狼论坛", "淫蜜", "蕩妹", "色狼小说", "淫魔", "肥逼", "湿穴", "淫母", "粉穴", "爽死我了", "淫妞", "干穴", "舔逼", "淫奴", "开苞", "舔屁眼",
			"淫娃", "口活", "好嫩", "淫液", "狼友", "钻插", "春药", "亂倫", "H动漫", "风艳阁", "交换夫妻", "激情小说", "情色", "兽欲", "做爱电影", "美腿",
			"全裸", "色诱", "舔脚", "秘唇", "秘裂", "蜜洞", "蜜穴", "采花堂", "玉穴", "含屌", "淫情", "应召", "亚洲性虐", "亚洲情色网", "菊花蕾", "鸡吧",
			"强奸处女", "大力抽送", "夫妻自拍", "鸡巴", "干的爽熟女", "鸡巴暴胀", "肛交", "操穴", "美乳", "裹本", "大众色情成人网", "肉蒲团", "淫妇", "火辣图片", "嫩逼",
			"淫声浪语", "淫叫", "淫贱", "疯狂抽送", "男女交欢", "欢乐性今宵", "淫河", "极品波霸", "巨乳", "强暴", "兽奸", "性愛圖片", "多人性愛", "流淫", "学生妹",
			"性欲", "销魂洞", "炮友之家", "操屄", "操烂", "浪女", "成人网站", "一夜情", "色情论坛", "淫色", "乳沟", "性虎色网", "一夜欢", "淫虫", "淫欲日本", "姦淫",
			"操死", "给你爽", "叫床", "色迷城", "偷窥图片", "性奴", "小姐打飞机", "骚女叫春", "大奶头", "少女被插", "成人百强", "fuck", "猖妓", "妓女", "Ｘ到噴屎尿",
			"天天干贴图", "奸幼", "口淫", "密穴贴图", "中年美妇", "按摩棒", "凌辱", "轮奸", "操我", "豪乳", "奸情", "小逼", "喷精", "被干", "酥痒", "逼奸",
			"露逼", "品色堂", "脱内裤", "美女高潮", "浪妇", "发浪", "日逼", "嫖妓指南", "浪叫", "肉洞", "肉缝", "肉茎", "阴缔", "色窝窝", "菊花洞", "插暴",
			"成人自拍", "人妻", "被操", "自拍美穴", "做爱", "巨奶", "抠穴", "内射", "骚洞", "颜射", "肉具", "阴精", "肉棍", "欲仙欲浪", "阴阜", "淫水爱液",
			"玉乳", "阴屄", "阴核", "被插", "群魔色舞", "露B", "吞精", "扒穴", "母子奸情", "暴乳", "六月联盟", "人妻熟女", "成人午夜场", "偷拍区", "色界", "买春堂",
			"张筱雨", "丁香社区", "性之站", "爱图公园", "成人社区", "极品黑丝", "色色五月天", "群交", "丝袜写真", "鹿城娱乐", "激情聊天", "天天情色", "色色", "三八淫",
			"成人小说", "幼香阁", "做爱自拍", "成人文学", "隐窝窝", "淫妻", "情色艺术天空", "乱伦熟女网", "夫妻俱乐部", "222se图片", "插阴", "激情交友", "偷拍",
			"露阴照", "诱色uu", "淫色贴图", "美幼", "就去色色", "厕奴", "熟妇", "成人", "嫩鲍鱼", "mm美图", "酥胸诱惑", "日本AV女优", "走光偷拍", "五月天",
			"美女走光", "人体摄影", "33bbb走光", "东北xx网", "激情贴图", "咪咪图片", "玛雅网", "成人论坛", "成人导航", "成人bt", "就去诱惑", "深爱色色", "周六性吧",
			"浴室自拍", "厕所偷拍", "爆乳", "成人A片", "诱惑视频", "激情裸体", "夫妻多p", "裙下风光", "丽春苑", "我就色", "嘻游中国", "窝窝客", "释欲", "操母狗",
			"银民吧", "你色吗", "御の二代目", "亚洲色", "裙内偷拍", "丝袜足交", "碧香亭", "男女蒲典", "肮脏美学", "爱色cc", "色97爱", "亚洲有码", "妹妹骚图", "丝诱",
			"欲仙欲死", "宾馆女郎", "人妻自拍", "丝袜高跟", "美腿丝足", "色情工厂", "偷拍美穴", "好色cc", "色色婷婷", "原味丝袜", "无码长片", "美体艳姿", "裸露自拍",
			"淫水涟涟", "颜射自拍", "针孔偷拍", "放荡少妇", "熟母", "放荡少妇宾馆", "成人图片", "肉丝裤袜", "性感肉丝", "黄金圣水", "sm调教", "拳交", "脚交", "打野炮",
			"迫奸", "勾魂少妇", "赤裸天使", "品香堂", "女尻", "淫欲世家", "北京xx网", "我要性交", "就去日", "虐奴", "SM女王", "爱幼阁", "情色导航", "乳此丝袜",
			"巨屌", "欧美大乳", "日本灌肠", "花样性交", "欧美无套", "集体性爱", "裸陪", "骚妇露逼", "国产骚货", "夫妻3p", "炮友", "操B指南", "大奶骚女", "淫水丝袜",
			"亚洲淫娃", "性愛插穴", "母女双飞", "熟女乱伦", "日本熟母", "老少乱伦", "SM舔穴", "幼逼", "幼妓", "無碼H漫", "淫水四溅", "素人娘", "大胆少女", "大胆出位 ",
			"前凸后翘", "乳此丰满", "旅馆自拍", "制服誘惑", "屄屄特写", "无套自拍", "舔屄", "熟女颜射", "快乐AV", "色色成人", "要色色", "国产无码", "迷奸系列", "耻辱轮奸",
			"强制浣肠", "性交无码", "巨乳素人", "援交自拍", "惹火自拍", "妩媚挑逗", "凸肉优", "胯下呻吟", "骚姨妈", "撅起大白腚", "淫驴屯", "裸体少妇", "骚妹妹", "少妇偷情",
			"美少妇", "插穴手淫", "护士诱惑", "射奶", "双龙入洞", "群奸乱交", "杨思敏", "美女吞精", "极品白虎", "野外性交", "处女开包", "曲线消魂", "风骚淫荡", "调教虐待",
			"淫腔", "白虎嫩B", "淫肉诱惑", "无码淫漫", "明星淫图", "激情潮喷", "假阳具插穴", "淫乱熟女", "骚穴怒放", "蝴蝶逼", "高清性愛", "馒头屄", "自插小穴", "高潮集锦",
			"无码丝袜", "SM援交", "淫兽学园", "写真", "西洋美女", "俏臀摄魄", "寂寞自摸", "爱液横流", "有容奶大", "警奴", "无码无套", "无套内射", "轮操", "淫战群P",
			"毛鲍", "淫店", "口爆", "3P炮图", "精液浴", "酒店援交", "性交课", "淫乱诊所", "乳霸", "激凸走光", "极品奶妹", "湿身诱惑", "性感妖娆", "惹火身材",
			"火辣写真", "人妻交换", "暴力虐待", "动漫色图", "监禁陵辱", "巨乳俏女医", "熟女护士", "生徒胸触", "扉之阴", "粉红穴", "東洋屄", "法轮功", "砝仑", "砝轮",
			"シ去车仑", "法?轮?功", "洗瑙", "江浙民", "自由网", "大法洪传", "弘法会", "灵修团体", "洪法交流", "610办公室", "江罗集团", "大法大福", "大砝弟子",
			"中共走狗", "共产小丑", "中共恶霸", "共产无赖", "天安门大屠杀", "天安门事件", "平反六四", "八九见证", "六四屠杀", "六四屠城", "六四政变", "起点中文", "逐浪文学",
			"東洋屄", "淫", "肉穴" };

	private static String[] bookCommentSensiveWords = { "操你妈", "你妈的", "垃圾", "cao", "傻比", "他妈的", "贱人", "蠢货", "鸡巴", "狗日的",
			"TNND", "他娘的", "他母亲的", "他老母的", "爱国善者", "真善忍", "五套功法", "宇宙最高法理", "砝仑", "砝轮", "シ去", "车仑", "工力", "大陆同修",
			"法?轮?功", "洗瑙", "江浙民", "自由网", "zhengjian", "yuanmingeurope", "xinsheng", "fawanghuihui", "大法洪传", "弘法会",
			"灵修团体", "大法之声", "法正人间", "正法时期", "洪法交流", "大法弟子", "大法师傅", "610办公室", "江罗集团", "发正念", "放下生死", "大法大福", "大砝弟子",
			"正念正行", "中共走狗", "共产小丑", "共奴", "中共恶霸", "共产无赖", "天安门大屠杀", "天安门事件", "平反六四", "八九见证", "支联会", "六四屠杀", "六四屠城",
			"六四政变", "momork", "www.", ".net", ".com", ".cn", "38693726", "346284665", "646438410", "375585761", "盗版",
			"盗帖", "手打", "OCR", "D版", "D帖", "法轮功", "起点中文", "cmfu", "逐浪文学", "zhulang" };

	private static String[] chapterSensiveWords = { "法轮功", "砝仑", "砝轮", "シ去车仑", "法?轮?功", "洗瑙", "江浙民", "自由网",
			"yuanmingeurope", "fawanghuihui", "大法洪传", "弘法会", "灵修团体", "洪法交流", "610办公室", "江罗集团", "大法大福", "大砝弟子", "中共走狗",
			"共产小丑", "中共恶霸", "共产无赖", "天安门大屠杀", "天安门事件", "平反六四", "八九见证", "六四屠杀", "六四屠城", "六四政变", "起点中文", "cmfu", "逐浪文学",
			"zhulang" };

	@SuppressWarnings({ "unchecked", "rawtypes" })
	private static ThreadLocal<String> currentSensiveWord = new ThreadLocal();

	private static boolean haveSensiveWord(String[] sensiveWords, String willCheckStr) {
		if (StringUtils.isEmpty(willCheckStr)) {
			return false;
		}
		for (int i = 0; i < sensiveWords.length; i++) {
			if (willCheckStr.indexOf(sensiveWords[i]) != -1) {
				setCurrentSensiveWord(sensiveWords[i]);
				return true;
			}
		}
		return false;
	}

	public static void setCurrentSensiveWord(String sensiveWord) {
		currentSensiveWord.set(sensiveWord);
	}

	public static String getCurrentSensiveWord() {
		return (String) currentSensiveWord.get();
	}

	public static boolean bookCommentHaveSensiveWord(String willCheckStr) {
		return haveSensiveWord(bookCommentSensiveWords, willCheckStr);
	}

	public static boolean chapterHaveSensiveWord(String willCheckStr) {
		return haveSensiveWord(chapterSensiveWords, willCheckStr);
	}

	public static boolean regHaveSensiveWord(String willCheckStr) {
		return haveSensiveWord(regSensiveWords, willCheckStr);
	}

	public Matcher checkqScreenWord(String content) {
		String forbidKeywords = getForbidKeywords();
		Matcher m = Pattern.compile(forbidKeywords).matcher(content);
		return m;
	}

	public static String getForbidKeywords() {
		return forbidKeywords;
	}

	public static String getFilterContent(String content) {
		if (content == null)
			return null;
		try {
			String[] key = (String[]) Memcached.get("forbidKeywords");
			if (key != null) {
				String cacheTime = key[0];
				if (!time.equals(cacheTime)) {
					time = cacheTime;
					forbidKeywords = key[1];
				}
			}
		} catch (Exception e) {
			System.out.println("com.flzc.base.util.WordControlUtil.getFilterContent() Memcached problem! ");
		}

		Matcher m = Pattern.compile(forbidKeywords).matcher(content);
		if (m.find()) {
			content = content.replaceAll(forbidKeywords, "***");
		}
		return content;
	}

	public static String filterSensiveWord(String willCheckStr) {
		if ((willCheckStr == null) || (willCheckStr.trim().length() == 0))
			return willCheckStr;
		Matcher matcher = Pattern.compile(forbidKeywords).matcher(willCheckStr);
		String tempStr = null;
		while (matcher.find()) {
			tempStr = copyN("*", matcher.group().length());
			willCheckStr = willCheckStr.replaceAll(matcher.group(), tempStr);
		}
		return willCheckStr;
	}

	public static String filterSensiveWord(String filterWords, String willCheckStr) {
		if ((willCheckStr == null) || (willCheckStr.trim().length() == 0))
			return willCheckStr;
		String[] v = filterWords.split("\\|");
		for (int i = 0; i < v.length; i++) {
			willCheckStr = willCheckStr.replaceAll(v[i], copyFilters("*", v[i].length()));
		}
		return willCheckStr;
	}

	public static String copyFilters(String str, int num) {
		StringBuffer sb = new StringBuffer("");
		for (int i = 0; i < num; i++) {
			sb.append(str);
		}
		return sb.toString();
	}

	public static String copyN(String str, int num) {
		StringBuffer sb = new StringBuffer("");
		for (int i = 0; i < num; i++) {
			sb.append(str);
		}
		return sb.toString();
	}
}